{
    "version": "https://jsonfeed.org/version/1",
    "title": "A11y Dojo",
    "description": "",
    "home_page_url": "https://jsydik.github.io/accessibility-dojo",
    "feed_url": "https://jsydik.github.io/accessibility-dojo/feed.json",
    "user_comment": "",
    "icon": "https://jsydik.github.io/accessibility-dojo/media/website/BannerWB.png",
    "author": {
        "name": "Jeremy Sydik"
    },
    "items": [
        {
            "id": "https://jsydik.github.io/accessibility-dojo/principles-before-guidelines.html",
            "url": "https://jsydik.github.io/accessibility-dojo/principles-before-guidelines.html",
            "title": "Principles Before Guidelines",
            "summary": "I prefer to take a principles before guidelines approach to accessibility. Staying focused on compliance issues is a common approach to accessibility, so it may seem surprising that I’m going to push the guidelines out of the way for now. If this concerns you, don’t&hellip;",
            "content_html": "<p class=\"p1\">I prefer to take a <em>principles before guidelines</em> approach to accessibility. Staying focused on compliance issues is a common approach to accessibility, so it may seem surprising that I’m going to push the guidelines out of the way for now. If this concerns you, don’t worry too much—I’ll eventually get to the topic of formal accessibility testing where standards and guidelines rule, and you’ll likely look longingly at these halcyon days.</p>\n<p class=\"p2\">When we get there, you’ll find that guidelines are important for sorting out details and testing for compliance but they’re not written as instructional documents. Our goal for the moment is helping as many people as possible get the information they want—not learning to be “rules lawyers.” When we add video to our sites, we don’t want to be thinking:</p>\n<blockquote>\n<p class=\"p2\">\"Section 508, §1194.24(c) says: All training and informational video and multimedia productions which support the agency’s mission, regardless of format, that contain speech or other audio information necessary for the comprehension of the content, shall be open or closed captioned\"</p>\n</blockquote>\n<p class=\"p2\">This places our priority on compliance instead of on our users. We really want think about it like this:</p>\n<blockquote>\n<p class=\"p2\">\"Ok, we’re using video. Which of our users does this affect? Well, for users who can’t see the video, we should add audio descriptions and we’ll add captions for people with hearing disabilities. Hmmm—Some of our users might not have the video player we’re asking for. We should also add a transcript of the video. Is there anyone else we might be missing?\"</p>\n</blockquote>\n<p class=\"p2\">This approach is user focused and, at the end of the day, that’s what accessibility is all about. It’ll also give you a framework for understanding the meaning of the guidelines when you get there.We’re going to follow ten rules when we design accessible sites:</p>\n<h2 id=\"mcetoc_1e3ku9rr10\" class=\"p1\">Ten Principles for Web Accessibility</h2>\n<ol class=\"ol1\">\n<li class=\"li2\">Avoid making assumptions about the the physical, mental, and sensory abilities of your users whenever possible.</li>\n<li class=\"li2\">Your users’ technologies are capable of sending and receiving text. That’s about all you’ll ever be able to assume.</li>\n<li class=\"li2\">Users’ time and technology belong to them, not to us. You should never take control of either without a really good reason.</li>\n<li class=\"li2\">Provide good text alternatives for any non-text content.</li>\n<li class=\"li2\">Use widely available technologies to reach your audience.</li>\n<li class=\"li2\">Use clear language to communicate your message.</li>\n<li class=\"li2\">Make your sites usable, searchable, and navigable.</li>\n<li class=\"li2\">Design your content for semantic meaning and maintain separation between content and presentation.</li>\n<li class=\"li2\">Progressively enhance your basic content by adding extra features. Allow it to fall back gracefully for users who can’t or don’t wish to use them.</li>\n<li class=\"li2\">As you encounter new accessibility challenges, apply these same principles as appropriate.</li>\n</ol>\n<p class=\"p2\">These principles apply to just about everything you’ll need to do to design accessibly. Of course, you’ll need to understand <em>how</em> to apply them. That’s good, because we’re just getting started.</p>",
            "image": "https://jsydik.github.io/accessibility-dojo/media/posts/2/JusticeNYC.jpg",
            "author": {
                "name": "Jeremy Sydik"
            },
            "tags": [
            ],
            "date_published": "2020-01-06T08:09:00-06:00",
            "date_modified": "2020-03-17T14:20:07-05:00"
        },
        {
            "id": "https://jsydik.github.io/accessibility-dojo/title-goes-here.html",
            "url": "https://jsydik.github.io/accessibility-dojo/title-goes-here.html",
            "title": "Once Upon a Time",
            "summary": "<p>Over a decade ago, I wrote a book about web accessibility to gather together the thoughts and experiences of ten-ish years working in the field.  All in all it was a great experience—I had the opportunity to work with the fine people at <a href=\"https://pragprog.com\" target=\"_blank\" rel=\"noopener noreferrer\">Pragmatic Bookshelf</a>, was able to speak about digital accessibility to broad audiences, met many other professionals exploring inclusive design, and engaged with readers who enjoyed the book and became advocates of accessibility themselves.  So what happened next?</p>\n",
            "content_html": "<p>Over a decade ago, I wrote a book about web accessibility to gather together the thoughts and experiences of ten-ish years working in the field.  All in all it was a great experience—I had the opportunity to work with the fine people at <a href=\"https://pragprog.com\" target=\"_blank\" rel=\"noopener noreferrer\">Pragmatic Bookshelf</a>, was able to speak about digital accessibility to broad audiences, met many other professionals exploring inclusive design, and engaged with readers who enjoyed the book and became advocates of accessibility themselves.  So what happened next?</p>\n\n<p>My path to inclusive design started in the summer of 199x.  I wrote in <a href=\"https://www.goodreads.com/book/show/2153345.Design_Accessible_Web_Sites\" target=\"_blank\" rel=\"noopener noreferrer\">Design Accessible Web Sites</a>:</p>\n<blockquote>\n<p>Back then, I was working as a student web developer and sysadmin and we needed a system for a blind user to work on a paper.  Simple enough—we had some new systems.  Just grab one, install it, add the specialized software and we're done.  I was fairly happy about the job—it was my first time through this kind of configuration and I finished with plenty of time so I added on nicer (I thought) speakers and keyboard.</p>\n<p>Our user came in and started to use the system—or at least tried to use the system.  Everything started to fall apart. The keyboard was one of the newer (at the time) ergonomic keyboards, which the user had never worked with.  The speakers were an even bigger problem.  They came out of the box set to a low volume and I hadn’t thought to set them high so they could be controlled from software.  The user began to panic when the interface to the system was completely disrupted.  Two decisions that wouldn’t have usually been a problem turned the afternoon into a disaster.</p>\n<p>Of course, the real problem was human, not technological.  My mistake was in my assumption about how people use computers which, of course, was how I used a computer.  I knew that blind users needed to use special software on their computers, but I didn’t consider the real difference in user experience.  Later that evening, I got curious about my web sites—seeing how much difference something as simple as a different keyboard could make, how would my sites behave for users with screen readers instead of monitors and keyboards but not mice?</p>\n<p>It wasn’t pretty.  I knew that I needed to design my sites differently, but what exactly did I need to do?  It turns out that accessibility isn’t really that much about what you do—it’s a matter of how you do it.  What I really needed was information on what being accessible means and how to think from the perspectives of many kinds of users.</p>\n</blockquote>\n<p>So that's what happened. I went to my HCI professor and started asking questions. At the time, HCI (now usually considered UX) wasn't a prominent topic in many computer science programs, so she advised that I go speak with some cognitive psychologists. As luck would have it, the ADA officer who ran the lab I was working in, Dr. Christy Horn, was a leading advocate for the rights of persons with disabilities as well as professor of educational psychology. She was also a persistent recruiter of graduate students—which resulted (eventually) in my own pursuit of a doctorate.</p>\n<p>John Lennon said it well—\"Life is what happens to you while you're busy making other plans.\"  The book was finished shortly before I completed my master's work, Christy and I continued to work on grants to improve higher education for students with disabilities, I eventually took over operations of the lab I started in, and my spouse and I added two more children to our lives.  Things were good but certainly busy.</p>\n<p>One day, a couple of years back, I got the note that all technical authors do that the run for Design Accessible Web Sites was finished and it would be going out of print.  It was around much longer than I expected, actually—better than half a decade if a great run for an edition.  Remarkably, the vast majority of the content is still relevant—there are certainly things that have become dated.  For example, I could now write the chapter on Flash in one word—\"Don't.\"  The real question was how to get this content back out there where it could be useful to others.</p>\n<p>I punted around the idea of revising a new edition, but held off.  I was finishing up my dissertation, raising my kids is always my chief priority, and then professional changes made life excessively busy for a couple of years.  More importantly, I noticed a pattern—every couple of years, a new accessibility author would put out a book, it would make its run, and then disappear into the twilight.  While I'm still very proud of the product, I'm not entirely sure that books are the best way to approach this kind of content.  Even at the time, I wrote the book a series of articles designed to be read out of order as needed in the process of professional practice.   </p>\n<p>So the answer is this - a return to blog style articles for the first time in a long while.  My plan is to revisit old content from Design Accessible Web Sites, splitting, updating, and remixing as needed as well as to periodically write up new things as they become timely.  At this point there is no particular schedule or timeline, so bear with me.</p>\n<p>As an aside, Design Accessible Web Sites began \"It was a dark and stormy night...\" (really).  My editor was <em>not at all</em> happy with this choice, but it got enough of a positive result from readers that I'll kick off this set of articles with \"Once upon a time\" anyway.    </p>",
            "image": "https://jsydik.github.io/accessibility-dojo/media/posts/1/Bulldozer-Vetsikas-BW.jpg",
            "author": {
                "name": "Jeremy Sydik"
            },
            "tags": [
            ],
            "date_published": "2020-01-01T00:00:00-06:00",
            "date_modified": "2020-03-17T14:11:53-05:00"
        },
        {
            "id": "https://jsydik.github.io/accessibility-dojo/its-not-polite-to-flash-your-audience.html",
            "url": "https://jsydik.github.io/accessibility-dojo/its-not-polite-to-flash-your-audience.html",
            "title": "It&#x27;s Not Polite to Flash Your Audience",
            "summary": "Life is interesting sometimes. Not long ago, I was writing a tip in Design Accessible Web Sites about flicker and photosensitive epilepsy. I kind of went back and forth about whether this was a common enough issue to worry about. In the end, I decided that&hellip;",
            "content_html": "Life is interesting sometimes. Not long ago, I was writing a tip in Design Accessible Web Sites about flicker and photosensitive epilepsy. I kind of went back and forth about whether this was a common enough issue to worry about. In the end, I decided that it was too important to not discuss in depth.<br><br>When video flickers at the right speed, some people have seizures. The degree of the seizure varies, but to be sure, this isn’t a pleasant way to relax watching television or a web video. If you test your video for flicker problems using <a href=\"http://www.hardingfpa.tv\" target=\"_blank\" rel=\"noopener noreferrer\">Harding FPA</a> or TRACE Center’s <a href=\"https://trace.umd.edu/peat\" target=\"_blank\" rel=\"noopener noreferrer\">Photosensitive Epilepsy Analysis Tool (PEAT)</a>, you can avoid inappropriate levels of flicker. If you don’t test it, you run the risk of seriously harming some of your users.<br><br>This was exactly what happened this week when a video introduction was rolled out for the 2012 London Olympics [<a href=\"http://news.bbc.co.uk/2/hi/uk_news/england/london/6724245.stm\" target=\"_blank\" rel=\"noopener noreferrer\">BBC News: Epilepsy fears over 2012 footage</a>]. A segment in this video featured a multicolor flicker that was not tested for problems and viewers suffered from seizures. Fortunately, it appears that fewer than a dozen people reported being affected by this video (An infamous episode of Pokemon a few years back had over 500 reported seizures). I’m not as concerned about the reported numbers as by the potential damage though—in the end, 23000 people in the UK were put at risk of seizures caused by this video.<br><br>Most of us don’t worry about things like the flicker rate of our content very often. It seems like a minor factor that effects only a few people. It’s never just a few people - a small percentage of the total population is still in the thousands. It’s also not a great way to do business. London mayor Ken Livingstone had these comments:<br><br>* \"If you employ someone to design a logo for you and they haven’t done a basic health check you have to ask what they do for their money\" [<a href=\"http://www.nytimes.com/2007/06/07/world/europe/07olympics.html\" target=\"_blank\" rel=\"noopener noreferrer\">New York Times: 2012 Olympic Logo: Sparks Precede the Flame</a>].<br>* \"Who would go into a firm like that again and ask them to do that work. This is a pretty basic thing\" [<a href=\"http://news.bbc.co.uk/2/hi/uk_news/england/london/6727029.stm\" target=\"_blank\" rel=\"noopener noreferrer\">BBC News: Mayor wades into 2012 footage row</a>].<br><br>These are important things to think about. As web designers, we make our livings by serving an audience. If we allow harm to come to that audience, we allow harm to come to ourselves.",
            "image": "https://jsydik.github.io/accessibility-dojo/media/posts/4/AccessMazeBW.jpg",
            "author": {
                "name": "Jeremy Sydik"
            },
            "tags": [
            ],
            "date_published": "2007-01-06T19:14:00-06:00",
            "date_modified": "2020-03-17T22:31:17-05:00"
        }
    ]
}
